spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16GhfsE7JwniA027pkrEBaL2
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.4
      Authorization:
      - Bearer sk_test_9SZCzWtrn9rSdujINLt8Urum
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.4","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Kai-Min-Changteki-MacBook-Pro.local 12.6.0 Darwin Kernel Version 12.6.0: Wed
        Mar 18 16:23:48 PDT 2015; root:xnu-2050.48.19~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 23 Jun 2015 03:22:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1899'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_5oYljVBdENSxc6RA
      Stripe-Version:
      - '2015-02-18'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16GhfsE7JwniA027pkrEBaL2",
          "created": 1435028532,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16GhfsE7JwniA0275TcjmIhk",
              "object": "charge",
              "created": 1435028532,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 500,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16GhfqE7JwniA027tByk7SYK",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 6,
                "exp_year": 2017,
                "fingerprint": "VBjjFK12L1YtJfTB",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": null
              },
              "captured": true,
              "balance_transaction": "txn_16GhfsE7JwniA027VoLfKSdT",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": null,
              "invoice": null,
              "description": "kevin@example.com",
              "dispute": null,
              "metadata": {},
              "statement_descriptor": null,
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16GhfsE7JwniA0275TcjmIhk/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_6TezrPwtwVTyQ9",
          "api_version": "2015-02-18"
        }
    http_version: 
  recorded_at: Tue, 23 Jun 2015 03:22:48 GMT
recorded_with: VCR 2.9.3
